{
  "home": {
    "slogan": "Creating beautiful experiences, one pixel at a time",
    "homeText": "I'm a front-end developer with (5+) years of experience. I excel in React, React Native, Vanilla JS, and SSR. I prioritize accessibility and user-friendliness in websites/apps. I have a solid track record in delivering quality results and am still always seeking to improve. I find inspiration in the intersection of technology and design, striving to make applications that serve a purpose and please users with their appearance.",
    "homePresentation": "Welcome to my portfolio!. I am a talented and experienced frontend programmer with over 5 years of industry expertise. With a keen eye for design, I strive to create visually stunning and user-friendly websites and applications. Throughout my career, I have had the privilege of working with clients and companies from diverse backgrounds and across various countries. This international exposure has not only broadened my horizons but also enhanced my ability to understand and cater to different cultural preferences. Fluent in both English and Spanish, I effectively communicate and collaborate with clients and team members from around the globe. My passion for frontend development is complemented by my strong skills in HTML, CSS, and JavaScript, ensuring seamless user experiences across different devices and platforms. I am well-versed in modern frameworks and libraries such as React or Next Js, enabling me to create dynamic and interactive applications that engage users. I approach every project with creativity, attention to detail, and a focus on user-centric design principles. By carefully understanding the needs and goals of each project, I craft intuitive and visually appealing interfaces that leave a lasting impression on users. Throughout my career, I have successfully collaborated with cross-functional teams, including designers, backend developers, and project managers, to create cohesive and impactful digital solutions. I thrive in fast-paced environments and am adept at meeting deadlines while maintaining the highest standards of quality. In my portfolio, you will find a collection of my past projects that highlight my expertise in frontend development and design. Each project demonstrates my ability to transform ideas into reality while incorporating the latest industry trends and best practices. Thank you for visiting my portfolio. I am excited to embark on new opportunities, collaborate on innovative projects, and bring exceptional digital experiences to life. Let's connect and create something remarkable together!.",
    "text": "<p class='mb-4'>Welcome to my portfolio! I am a talented and experienced frontend programmer with over 5 years of industry expertise. With a keen eye for design, I strive to create visually stunning and user-friendly websites and applications.</p><p class='mb-4'>Throughout my career, I have had the privilege of working with clients and companies from diverse backgrounds and across various countries. This international exposure has not only broadened my horizons but also enhanced my ability to understand and cater to different cultural preferences.</p><p class='mb-4'>Fluent in both English and Spanish, I effectively communicate and collaborate with clients and team members from around the globe. My passion for frontend development is complemented by my strong skills in HTML, CSS, and JavaScript, ensuring seamless user experiences across different devices and platforms.</p><p class='mb-4'>I am well-versed in modern frameworks and libraries such as React or Next Js, enabling me to create dynamic and interactive applications that engage users.</p><p class='mb-4'>I approach every project with creativity, attention to detail, and a focus on user-centric design principles. By carefully understanding the needs and goals of each project, I craft intuitive and visually appealing interfaces that leave a lasting impression on users.</p><p class='mb-4'>Throughout my career, I have successfully collaborated with cross-functional teams, including designers, backend developers, and project managers, to create cohesive and impactful digital solutions. I thrive in fast-paced environments and am adept at meeting deadlines while maintaining the highest standards of quality.</p><p class='mb-4'>In my portfolio, you will find a collection of my past projects that highlight my expertise in frontend development and design. Each project demonstrates my ability to transform ideas into reality while incorporating the latest industry trends and best practices.</p><p class='mb-4'>Thank you for visiting my portfolio. I am excited to embark on new opportunities, collaborate on innovative projects, and bring exceptional digital experiences to life. Let's connect and create something remarkable together!</p>",
    "author": "Miguel Angel Rivas"
  },
  "services": {
    "process": [
      {
        "title": "Web Development",
        "description": "I go beyond just coding websites; I create immersive online experiences. My talent combines technical prowess with artistic sensibilities to design visually striking websites. I ensure that your site not only looks exceptional but also functions flawlessly across different devices and browsers."
      },
      {
        "title": "App Development",
        "description": "In the fast-paced world of mobile technology, having a powerful app is crucial for success. I bring your ideas to life, developing intuitive and engaging mobile applications for iOS and Android platforms. I prioritize user experience, ensuring that your app is easy to navigate, visually appealing, and optimized for performance."
      },
      {
        "title": "Aesthetics",
        "description": "I understand the importance of visual appeal in leaving a lasting impression. I carefully craft user interfaces that are not only visually stunning but also align with your brand identity. I pay attention to every detail, ensuring that your website or app stands out from the competition."
      },
      {
        "title": "Semantics",
        "description": "Behind every great digital experience lies a solid foundation of clean and semantic code. I adhere to industry best practices and use the latest technologies to ensure that your website or app is well-structured, search engine-friendly, and easily maintainable."
      },
      {
        "title": "Accessibility",
        "description": "I believe in inclusivity, which is why I prioritize accessibility in the development process. I ensure that your website or app meets accessibility standards, making it usable for people with disabilities. By incorporating accessibility features, I help you reach a wider audience and demonstrate your commitment to inclusivity."
      }
    ]
  },
  "processOfCreation": {
    "heading": "Services",
    "service": "Empowering Brands Through Stunning Web Experiences",
    "process": [
      {
        "subheading": "Your Story",
        "description": "Welcome to share your story with me. In this stage, I will ask detailed questions about your requirements and understand the mission of your brand. By getting to know each other and confirming our goals, we will set the foundation for our project."
      },
      {
        "subheading": "Assessment",
        "description": "Team Up and Prepare. After fully understanding your requirements, the plan we set will be the cornerstone of our agreement. It will include the project quote, schedule, and contract, which will serve as the foundation of our project."
      },
      {
        "subheading": "Planning",
        "description": "A Clear Path. Proper preparation is key. We'll conduct a design-oriented survey to thoroughly examine the essence of your brand. Using the extensive brand data and practical experience collected, we'll conduct targeted research and develop an accurate visual strategy."
      },
      {
        "subheading": "Development",
        "description": "The Main Event. In this stage, we will have a clear brand positioning. By developing a distinct and unique visual system that considers different scenarios, cultures, and uses, we will establish a consistent and comprehensive brand image."
      },
      {
        "subheading": "Deployment",
        "description": "Quality, Quality, Quality. In order to ensure the perfect presentation of the design result and successful production, we will provide print and media manufacturing supervision services. During the production process, we will closely communicate with the cooperative factory to pursue the improvement of the product quality."
      },
      {
        "subheading": "Completion",
        "description": "Don't forget the farewell gift. After the image recognition is complete, we will ensure the smooth operation of the brand, not only confirming the design handover, but also providing the necessary training, documentation and support materials, etc. to ensure the successful implementation of the brand."
      }
    ]
  },
  "experience": {
    "title": "Experience",
    "jobs": [
      {
        "name": "Front-End",
        "company": "Consid AB",
        "place": "Sweden",
        "date": "Dec 2021 - ongoing",
        "tech": [
          "React",
          "Next.js",
          "Tailwind",
          "Storybook",
          "JavaScript",
          "HTML",
          "CSS"
        ],
        "description": "I am currently managing and developing an existing e-commerce website, as well as working on a new component library project. I am working with server-side rendering to improve load times and reduce data transfer. I am utilizing code splitting and lazy loading to improve performance by only loading necessary components and resources. I am also optimizing images and other media assets to reduce file size and improve loading times."
      },
      {
        "name": "Front-End",
        "company": "HejAlbert",
        "place": "Sweden",
        "date": "Oct 2021 - Dec 2021",
        "tech": [
          "React Native",
          "Styled Components",
          "Typescript",
          "Redux",
          "JavaScript",
          "HTML",
          "CSS"
        ],
        "description": "Worked on the development of a new feature for a mobile application using React Native, Typescript. Improved the user experience by implementing new features and functionality for a punctual time as Black Friday and Chirstmas, resulting in increased engagement. Also integrated Google Analytics to track usage and performance."
      },
      {
        "name": "Front-End",
        "company": "BeeReal",
        "place": "Argentina",
        "date": "2020 - 2021",
        "tech": [
          "React",
          "React Native",
          "Redux Thunk",
          "Sass",
          "JavaScript",
          "HTML",
          "CSS",
          "Firebase"
        ],
        "description": "Led the development of an external website for BeeReal as a solution architect, utilizing React Native, Redux, Firebase to create a seamless and intuitive user experience. Implemented blocks and modules with associated styling for a new mobile app, improving the overall design and functionality."
      },
      {
        "name": "Front-End",
        "company": "IT Resources",
        "place": "Argentina",
        "date": "2019 - 2020",
        "tech": [
          "React",
          "React Native",
          "Redux Thunk",
          "JavaScript",
          "HTML",
          "CSS"
        ],
        "description": "Contributed to the development of a web application using React and React Native, focusing on expanding features and refining processes. Improved the overall user experience by implementing new features and optimizing usability standards. Worked within the Agile Scrum framework to deliver high-quality results on a tight timeline."
      },
      {
        "name": "Front-End",
        "company": "Globant",
        "place": "Argentina",
        "date": "2018 - 2019",
        "tech": [
          "Angular 2.0",
          "RxJS",
          "JavaScript",
          "HTML",
          "CSS"
        ],
        "description": "I played an active role in the development of the product from start to finish, using Angular +2. My contributions included improving various features for thousands of users."
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "header": "The process of creating a project involves identifying the goal and scope, gathering resources and assembling a team, developing a plan, and regularly assessing progress. Once the project is completed, it is important to reflect on the process and evaluate its success. This includes reviewing what worked well, what could have been done differently, and what can be learned from the experience. In conclusion, if you'd like to work together to build a solid process for your project, I'm here to help. Let's chat!",
    "description": "Welcome to my Projects section! Here, you'll find a collection of the work that I'm most proud of and that best showcases my skills and experience. On this page, you'll find a variety of projects that I've worked on, including web development projects, data analysis projects, and software engineering projects. Each project includes a brief description, screenshots, and a link to view or interact with the project. I've chosen to include projects that demonstrate my technical skills, as well as my ability to work on a team and think creatively. You'll see how I've tackled real-world problems and delivered solutions that were both functional and visually appealing. I hope that you'll find my projects to be informative and interesting."
  },
  "contact": {
    "title": "Contact",
    "shortText": "Get in touch with me to explore opportunities for collaboration, advice, and support. Whether for personal or professional reasons, maintaining connections can bring valuable benefits. Don't hesitate to reach out.",
    "longText": "Keeping in touch with people can be incredibly beneficial for a variety of reasons. For starters, staying connected with others allows you to stay up-to-date on their work and projects, which can be especially useful if you're in the same field or have similar interests. It also gives you the opportunity to collaborate on future projects or opportunities, which can help you grow both personally and professionally. Maintaining connections with others can also provide support and encouragement in your endeavors. Whether you're facing challenges in your career or personal life, having a network of people you can turn to for advice or simply to lend an ear can be incredibly valuable. And of course, keeping in touch with others can also be a great way to share resources and advice, whether you're looking for recommendations for a service provider or just want to bounce ideas off someone. In addition to the practical benefits of staying connected with others, keeping in touch with people can also be a great way to build and maintain a strong professional network. Having a diverse network of contacts can open up new doors and opportunities, and staying in touch with people you've worked with in the past can help you stay top-of-mind when those opportunities arise. But beyond the professional benefits, keeping in touch with others can also be simply enjoyable. In short, keeping in touch with others can be incredibly beneficial for both personal and professional reasons. Whether you're looking to collaborate on projects, seek advice or support, do not hesitate to reach out.",
    "email": "rivasmig@gmail.com",
    "address": "Backhausgatan 1. Post Code 30296 Halmstad, Sweden",
    "phone": "+46 072 44 37 587",
    "media": [
      {
        "name": "linkedin",
        "url": "https://linkedin.com/in/miguelrivasin/"
      },
      {
        "name": "github",
        "url": "https://github.com/miuel/"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/2N_mikel"
      }
    ]
  },
  "notFound": {
    "text": "Page Not Found. Error 404",
    "button": "Go Home"
  },
  "marqueeHeaderText": [
    {
      "text": "welcome"
    },
    {
      "text": "Miguel's Portfolio Site"
    },
    {
      "text": "Technology and aesthetics, hand in hand"
    },
    {
      "text": "Front-End Developer"
    },
    {
      "text": "Innovating the present, shaping the future"
    },
    {
      "text": "Keep it simple, make it stand out"
    }
  ],
  "navigation": [
    {
      "name": "HOME",
      "url": "/"
    },
    {
      "name": "SERVICES",
      "url": "/services"
    },
    {
      "name": "EXPERIENCE",
      "url": "/experience"
    },
    {
      "name": "PROJECTS",
      "url": "/projects"
    },
    {
      "name": "CONTACT",
      "url": "/contact"
    }
  ],
  "footer": [
    {
      "text": "contact >>> rivasmig@gmail.com >>> +46 072 44 37 587 >>> Oskaström, Sweden"
    },
    {
      "text": "social >>> linkedin.com/in/miguelrivasin/ >>> github.com/miuel"
    },
    {
      "text": "2023"
    }
  ],
  "cvText": "Download CV",
  "mapText": "Oskaström, Sweden",
  "images": {
    "logo": "../assets/images/logo.png",
    "imgMonkey": "../../assets/images/collage.png",
    "collageAnimal": "../assets/images/collage-animal.png",
    "grid": "../assets/images/grid.png",
    "cv": "../assets/images/cv_en_sw.pdf",
    "map": "../assets/images/halmstad.png",
    "intro": "../assets/images/intro_body.gif",
    "wallet": "../assets/images/projects/jobs/itr/wallet.gif",
    "walletSm": "../assets/images/projects/jobs/itr/wallet-sm.gif",
    "ospuncba": "../assets/images/projects/jobs/beereal/ospuncba.gif",
    "letters": "../assets/images/projects/personal/letters.gif",
    "organic": "../assets/images/projects/personal/organic.mp4",
    "headphone": "../assets/images/headphone.gif",
    "handsome": "../assets/images/handsome.jpeg",
    "me": "../assets/images/me.png",
    "hospitalBritanico": "../assets/images/projects/jobs/itr/hospitalBritanico.gif",
    "fashionable": "../assets/images/fashionable.jpeg",
    "MR2B": "../assets/images/MR2B.png",
    "patternpad": "../assets/images/patternpad.svg",
    "jag": "../assets/images/home.jpeg",
    "patternpadMarquee": "../assets/images/patternpadMarquee.svg",
    "rembrandt": "../assets/images/rembrandt.png",
    "naturvardsverket": "../assets/images/projects/jobs/consid/nv/nv.png",
    "sverigesnationalparker": "../assets/images/projects/jobs/consid/nv/snp.png",
    "lavinprognoser": "../assets/images/projects/jobs/consid/nv/lavin.png",
    "agrosty": "../assets/images/projects/jobs/agrosty/agrosty.png",
    "icons": [
      {
        "icon": "angular"
      },
      {
        "icon": "babel"
      },
      {
        "icon": "bower"
      },
      {
        "icon": "css"
      },
      {
        "icon": "deno"
      },
      {
        "icon": "docker"
      },
      {
        "icon": "eslint"
      },
      {
        "icon": "figma"
      },
      {
        "icon": "firebase"
      },
      {
        "icon": "flutter"
      },
      {
        "icon": "github"
      },
      {
        "icon": "grunt"
      },
      {
        "icon": "gulp"
      },
      {
        "icon": "html"
      },
      {
        "icon": "javascript"
      },
      {
        "icon": "jira"
      },
      {
        "icon": "jquery"
      },
      {
        "icon": "json"
      },
      {
        "icon": "nextJs"
      },
      {
        "icon": "nodejs"
      },
      {
        "icon": "npm"
      },
      {
        "icon": "preact"
      },
      {
        "icon": "prettier"
      },
      {
        "icon": "react"
      },
      {
        "icon": "redux"
      },
      {
        "icon": "reduxSaga"
      },
      {
        "icon": "rxjs"
      },
      {
        "icon": "sass"
      },
      {
        "icon": "sketch"
      },
      {
        "icon": "styledComponents"
      },
      {
        "icon": "svelte"
      },
      {
        "icon": "tailwindcss"
      },
      {
        "icon": "typescript"
      }
    ]
  }
}